In [7]:
import pandas as pd
import numpy as np

In [54]:
DATA_PATH = "./data/car-sales-missing-data.csv"

## 2 ways of dealing with missing data
- Imputation (replacing missing values with some data)
- Removing samples with missing data
* <b> NOTE: There is not better way of dealing with missing data

In [8]:
df = pd.read_csv(DATA_PATH)

In [12]:
df.head(4)

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000

In [9]:
df.isna().sum()

Make        1
Colour      1
Odometer    4
Doors       1
Price       2
dtype: int64

In [11]:
MISSING_VALUE = "Missing"

In [10]:
# Fill Missing data with Pandas

def fill_missing_data_with_missing(data, feature, missing_value):
    data[feature].fillna(missing_value, inplace=True)

In [14]:
for m in ["Make", "Colour"]:
    fill_missing_data_with_missing(df, m, MISSING_VALUE)

In [15]:
df

      Make   Colour  Odometer  Doors    Price
0   Toyota    White  150043.0    4.0   $4,000
1    Honda      Red   87899.0    4.0   $5,000
2   Toyota     Blue       NaN    3.0   $7,000
3      BMW    Black   11179.0    5.0  $22,000
4   Nissan    White  213095.0    4.0   $3,500
5   Toyota    Green       NaN    4.0   $4,500
6    Honda  Missing       NaN    4.0   $7,500
7    Honda     Blue       NaN    4.0      NaN
8   Toyota    White   60000.0    NaN      NaN
9  Missing    White   31600.0    4.0   $9,700

In [20]:
# Fill Missing Odometer with mean of values

92302.66666666667

In [27]:
df['Odometer'].fillna(int(df.Odometer.mean()))
df.Doors.fillna(4, inplace=True)

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Make      10 non-null     object
 1   Colour    10 non-null     object
 2   Odometer  6 non-null      float64
 3   Doors     10 non-null     float64
 4   Price     8 non-null      object
dtypes: float64(2), object(3)
memory usage: 528.0+ bytes

In [33]:
pd.DataFrame(df.Odometer)

   Odometer
0  150043.0
1   87899.0
2       NaN
3   11179.0
4  213095.0
5       NaN
6       NaN
7       NaN
8   60000.0
9   31600.0

In [34]:
fill_missing_data_with_missing(df, "Odometer", int(df.Odometer.mean()))

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Make      10 non-null     object
 1   Colour    10 non-null     object
 2   Odometer  10 non-null     float64
 3   Doors     10 non-null     float64
 4   Price     8 non-null      object
dtypes: float64(2), object(3)
memory usage: 528.0+ bytes

In [47]:
# Check for sum of missing data across features 
df.isna().sum()

Make        0
Colour      0
Odometer    0
Doors       0
Price       0
dtype: int64

In [45]:
# Remove rows with Missing Price Values
df.dropna(inplace=True)

In [46]:
# Verifying removal of missing data.
df.isna().sum()

Make        0
Colour      0
Odometer    0
Doors       0
Price       0
dtype: int64

In [48]:
df

      Make   Colour  Odometer  Doors    Price
0   Toyota    White  150043.0    4.0   $4,000
1    Honda      Red   87899.0    4.0   $5,000
2   Toyota     Blue   92302.0    3.0   $7,000
3      BMW    Black   11179.0    5.0  $22,000
4   Nissan    White  213095.0    4.0   $3,500
5   Toyota    Green   92302.0    4.0   $4,500
6    Honda  Missing   92302.0    4.0   $7,500
9  Missing    White   31600.0    4.0   $9,700

In [49]:
X = df.drop("Price", axis=1)
y = df["Price"]

      Make   Colour  Odometer  Doors
0   Toyota    White  150043.0    4.0
1    Honda      Red   87899.0    4.0
2   Toyota     Blue   92302.0    3.0
3      BMW    Black   11179.0    5.0
4   Nissan    White  213095.0    4.0
5   Toyota    Green   92302.0    4.0
6    Honda  Missing   92302.0    4.0
9  Missing    White   31600.0    4.0

In [52]:
# Encoding Values
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer
categorical_features = ["Make", "Colour", "Doors"]
# encoding the categories passthrough means leave others as they are 
one_hot = OneHotEncoder()
transformer = ColumnTransformer([("one_hot", one_hot, categorical_features)], remainder="passthrough")
transformed_X = transformer.fit_transform(df)


# Convert to dataframe and print
pd.DataFrame(transformed_X).head(3)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0,150043.0,"$4,000"
1,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0,87899.0,"$5,000"
2,0.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,92302.0,"$7,000"

      Make   Colour  Odometer  Doors
0   Toyota    White  150043.0    4.0
1    Honda      Red   87899.0    4.0
2   Toyota     Blue   92302.0    3.0
3      BMW    Black   11179.0    5.0
4   Nissan    White  213095.0    4.0
5   Toyota    Green   92302.0    4.0
6    Honda  Missing   92302.0    4.0
9  Missing    White   31600.0    4.0

## 2 Fill Missing Values with Scikit-Learn

In [57]:
df_scikit_fill = pd.read_csv('./data/car-sales-extended-missing-data.csv')
df_scikit_fill.head(3)

    Make Colour  Odometer (KM)  Doors    Price
0  Honda  White        35431.0    4.0  15323.0
1    BMW   Blue       192714.0    5.0  19943.0
2  Honda  White        84714.0    4.0  28343.0

In [58]:
df_scikit_fill.isna().sum()

Make             49
Colour           50
Odometer (KM)    50
Doors            50
Price            50
dtype: int64

In [59]:
# DROPPING ROWS WITHOUT PRICE VALUES 
df_scikit_fill.dropna(subset=["Price"], inplace=True)
df_scikit_fill.isna().sum()

Make             47
Colour           46
Odometer (KM)    48
Doors            47
Price             0
dtype: int64

In [60]:
# SPLIT INTO X AND Y
X = df_scikit_fill.drop("Price", axis=1)
y = df_scikit_fill["Price"]

In [63]:
X.isna().sum()

Make             47
Colour           46
Odometer (KM)    48
Doors            47
dtype: int64

In [62]:
# FILL MISSING VALUES WITH SCIKIT-LEARN
from sklearn.impute import SimpleImputer
from sklearn.compose import ColumnTransformer

In [65]:
# FILL CATEGORICAL VALUES WITH MISSING AND NUMERICAL WITH MEAN
cat_imputer = SimpleImputer(strategy="constant", fill_value="Missing")
door_imputer = SimpleImputer(strategy="constant", fill_value=4)
num_imputer = SimpleImputer(strategy="mean")

# DEFINE COLUMNS
cat_features = ["Make", "Colour"]
door_feature = ["Doors"]
num_feature = ["Odometer (KM)"]

# CREATE AN IMPUTER, THATS SOMETHING THE FILLS MISSING DATA 
imputer = ColumnTransformer([
    ("cat_imputer", cat_imputer,cat_features),
     ("door_imputer", door_imputer,door_feature),
     ("num_imputer", num_imputer,num_feature),
    
])

# TRANSFORM THE DATA 
filled_X = imputer.fit_transform(X)
filled_X

array([['Honda', 'White', 4.0, 35431.0],
       ['BMW', 'Blue', 5.0, 192714.0],
       ['Honda', 'White', 4.0, 84714.0],
       ...,
       ['Nissan', 'Blue', 4.0, 66604.0],
       ['Honda', 'White', 4.0, 215883.0],
       ['Toyota', 'Blue', 4.0, 248360.0]], dtype=object)